# cleaning iranian dataset 10K transaction

In [1]:
import pandas as pd

df = pd.read_csv('archive/trx-10k.csv')

print('========Lima baris pertama==============')
display(df.head())

print('\n----info tipe data----')
print(df.info())

========Lima baris pertama==============

    status                 time card_type     city     amount  id
0  success  2025-09-07 10:48:00      Visa   Tehran  1427657.0  98
1  success  2025-09-20 13:10:00  MastCard   Tehran  1578078.0  52
2     fail  2025-09-29 03:27:00      Visa  Tehran    250000.0  20
3  success  2025-09-15 13:13:00  Discover  Isfahan        0.0  40
4  success  2025-09-11 11:11:00      Visa   Tehran  1782689.0  59

----info tipe data----
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   status     10000 non-null  object
 1   time       10000 non-null  object
 2   card_type  9689 non-null   object
 3   city       9884 non-null   object
 4   amount     10000 non-null  float64
 5   id         10000 non-null  int64
dtypes: float64(1), int64(1), object(4)
memory usage: 468.9+ KB
None

**Handling missing values**

In [2]:
# cek missing values semua variable
print(df.isna().sum())

status         0
time           0
card_type    311
city         116
amount         0
id             0
dtype: int64